; domain
;; At work domain
;;

(define (domain atwork)
  (:requirements :typing)
  (:types robot location item)

  (:predicates 
     (path ?l1 ?l2 - location)
     (at ?r - robot ?l - location)
     (on ?l - location ?o - item)
     (holding ?r - robot ?o - item)
     (after ?o1 ?o2 - item)
  )

;;  (:functions
;;     (path-length ?l1 ?l2 - location) - number
;;     (total-cost) - number
;;  )

  (:action move-to
    :parameters (?r - robot ?l1 ?l2 - location)
    :precondition (and
        (at ?r ?l1)
        (path ?l1 ?l2)
      )
    :effect (and
        (not (at ?r ?l1))
        (at ?r ?l2)
;;        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?r - robot ?l - location ?o - item)
    :precondition (and
        (at ?r ?l)
        (on ?l ?o)
      )
    :effect (and
        (not (on ?l ?o))
        (holding ?r ?o)
      )
  )

  (:action drop
    :parameters (?r - robot ?l - location ?o - item)
    :precondition (and
        (not (on ?l ?o))
        (holding ?r ?o)
        (at ?r ?l)
      )
    :effect (and
        (not (holding ?r ?o))
        (on ?l ?o)
      )
  )
)

; problem
; atwork problem-2

(define (problem atwork-3)
 (:domain atwork)
 (:objects
  bot-1 - robot
  station-1 - location
  station-2 - location
  station-3 - location
  object-1 - item
  object-2-1 - item
  object-2-2 - item
  object-3 - item
  object-4 - item
 )
 (:init
  (path station-1 station-2)
  (path station-1 station-3)
  (path station-2 station-1)
  (path station-2 station-3)
  (path station-3 station-1)
  (path station-3 station-2)
  (on station-3 object-1)
  (on station-3 object-2-1)
  (on station-3 object-2-2)
  (on station-3 object-3)
  (on station-3 object-4)
  (at bot-1 station-1)
 )
 (:goal (and
  (on station-1 object-1)
  (on station-1 object-2-1)
  (on station-1 object-2-2)
  (on station-1 object-3)
  (on station-1 object-4)
 ))
)

; plan
1. (move-to bot-1 station-1 station-3)
   deleted: (at bot-1 station-1)
   added: (at bot-1 station-3)
   goals met: 0 of 5
2. (pick-up bot-1 station-3 object-1)
   deleted: (on station-3 object-1)
   added: (holding bot-1 object-1)
   goals met: 0 of 5
3. (pick-up bot-1 station-3 object-2-1)
   deleted: (on station-3 object-2-1)
   added: (holding bot-1 object-2-1)
   goals met: 0 of 5
4. (pick-up bot-1 station-3 object-2-2)
   deleted: (on station-3 object-2-2)
   added: (holding bot-1 object-2-2)
   goals met: 0 of 5
5. (pick-up bot-1 station-3 object-3)
   deleted: (on station-3 object-3)
   added: (holding bot-1 object-3)
   goals met: 0 of 5
6. (pick-up bot-1 station-3 object-4)
   deleted: (on station-3 object-4)
   added: (holding bot-1 object-4)
   goals met: 0 of 5
7. (move-to bot-1 station-3 station-1)
   deleted: (at bot-1 station-3)
   added: (at bot-1 station-1)
   goals met: 0 of 5
8. (drop bot-1 station-1 object-1)
   deleted: (holding bot-1 object-1)
   added: (on station-1 object-1)
   goals met: 1 of 5
9. (drop bot-1 station-1 object-2-1)
   deleted: (holding bot-1 object-2-1)
   added: (on station-1 object-2-1)
   goals met: 2 of 5
10. (drop bot-1 station-1 object-2-2)
   deleted: (holding bot-1 object-2-2)
   added: (on station-1 object-2-2)
   goals met: 3 of 5
11. (drop bot-1 station-1 object-3)
   deleted: (holding bot-1 object-3)
   added: (on station-1 object-3)
   goals met: 4 of 5
12. (drop bot-1 station-1 object-4)
   deleted: (holding bot-1 object-4)
   added: (on station-1 object-4)
   goals met: 5 of 5
